'''
1. Добавьте в GeneticAlgori thm поддержку расширенной формы турнирного отбора, которая может иногда выбирать вторую или третью по жизнеспособности
хромосому, основываясь на уменьшающейся вероятности.
2. Добавьте к структуре с ограничениями, описанной в главе 3, новую функцию,
которая решает любой произвольный CSP с использованием генетического
алгоритма. Возможной мерой жизнеспособности является количество ограничений, которые разрешаются данной хромосомой.
3. Создайте класс Bi tString, который реализует хромосому. Для того чтобы
вспомнить, что представляет собой битовая строка, обратитесь к главе 1. Затем
примените новый класс для решения задачи простого уравнения из раздела 5.3.
Как можно представить эту задачу в виде битовой строки? '''