'''
1. Продемонстрируйте преимущество в производительности бинарного поиска
по сравнению с линейным поиском, создав список из миллиона чисел и определив, сколько времени потребуется созданным в этой главе функциям linear _
contains() и Ьinary_contains() для поиска в нем различных чисел.
2. Добавьте в dfs(), bfs() и astar() счетчик, который по;шолит увидеть, сколько
состояний просматривает каждая из этих функций в одном и том же лабиринте.
Найдите значения счетчика для 100 различных лабиринтов, чтобы получить
статистически значимые результаты.
3. Найдите решение зада'ш о миссионерах и ка1111иба.11ах /\ЛЯ разного начального
числа миссионеров и каннибалов. Подсказка: вам может понадобиться добавить
в MCState переопределения методов _eq_() и _hash_( ).
'''