'''1. Напишите еще одну функцию, которая выч11сляет п-й элемент последовательности Фибонач•ш, используя метод вашей со6ствешrой разра6отки. Напишите
модульные тесты, которые оценивали бы прав11ль1юсть ;пой функции и се 11ро11зводителыюсть, по сравнению с другими нсрсиями, 11рс11став;1с1111ыми в этой
главе.
2. Вы видели, как можно применять простой тип int в Pyt\1011 для представления строки битов. Напишите эргономичную о6ертку для int, которую можно
было бы ис11ользовать как 1юследовательность битов (c/\CJl<lЙTc се итеративной
и реализуйте _geti tem _() ). Переопределитt• CompressedGene с 1юмощью этой
обертки.
3. Напишите программу решения задачи о ханойских 6ашнях, которая ра6отала бы
для любого количества башен.
4. Эадействуйте одноразовый шифр для шифро11щ1ия и ;1с111ифровки изображений.
'''